app/Controllers/admin/Bpd.php

    public function dataMember()
    {
        $idKota = session()->get('id_kota');

        if (!$idKota) {
            return redirect()->to('/login')->with('error', 'Kota tidak ditemukan di session');
        }

        // ambil data kota dari tabel
        $kota = $this->kotaModel->find($idKota);

        // ✅ Ambil semua data member yang terkait kota BPD
        $members = $this->memberModel
            ->select('tb_members.*,
                prov.nama_provinsi,
                kota.nama_kota,
                kec.nama_kecamatan,
                desa.nama_desa')
            ->join('tb_provinsi prov', 'prov.id_provinsi = tb_members.id_provinsi', 'left')
            ->join('tb_kota_kabupaten kota', 'kota.id_kota = tb_members.id_kota', 'left')
            ->join('tb_kecamatan kec', 'kec.id_kecamatan = tb_members.id_kecamatan', 'left')
            ->join('tb_desa_kelurahan desa', 'desa.id_desa = tb_members.id_desa', 'left')
            ->where('tb_members.id_kota', $idKota)
            ->where('tb_members.status', 'Aktif')
            ->orderBy('tb_members.id', 'DESC')
            ->findAll();
---
SELECT `tb_members`.*, `prov`.`nama_provinsi`, `kota`.`nama_kota`, `kec`.`nama_kecamatan`, `desa`.`nama_desa`
FROM `tb_members`
LEFT JOIN `tb_provinsi` `prov` ON `prov`.`id_provinsi` = `tb_members`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` `kota` ON `kota`.`id_kota` = `tb_members`.`id_kota`
LEFT JOIN `tb_kecamatan` `kec` ON `kec`.`id_kecamatan` = `tb_members`.`id_kecamatan`
LEFT JOIN `tb_desa_kelurahan` `desa` ON `desa`.`id_desa` = `tb_members`.`id_desa`
WHERE `tb_members`.`id_kota` = '1105'
AND `tb_members`.`status` = 'Aktif'
ORDER BY `tb_members`.`id` DESC