app/Controllers/admin/Bpd.php

SELECT *
FROM `tb_aduan`
ORDER BY `created_at` DESC
---
    public function listAduan()
    {
        $aduanModel = new AduanModel();
        $data['aduan'] = $aduanModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `tb_artikel`
WHERE `created_label` = 'Kabupaten Aceh Barat'
ORDER BY `tanggal_publikasi` DESC
---
    public function indexArtikel()
    {
        $data['title'] = 'Kelola Artikel';

        // ✅ Use the same resolvePublisherLabel() logic for filtering
        $publisherLabel = $this->resolvePublisherLabel();

        $data['artikels'] = $this->artikelModel
            ->where('created_label', $publisherLabel)
            ->orderBy('tanggal_publikasi', 'DESC')
            ->findAll();