app/Controllers/admin/Bpdes.php

    public function indexArtikel()
    {
        $publisherLabel = $this->resolvePublisherLabel();
        $artikels = $this->artikelModel
            ->where('created_label', $publisherLabel)
            ->orderBy('tanggal_publikasi', 'DESC')
            ->findAll();
---
SELECT *
FROM `tb_artikel`
WHERE `created_label` = 'Alue Bagok'
ORDER BY `tanggal_publikasi` DESC

    private function resolvePublisherLabel(): string
    {
        $role = strtolower((string) session()->get('role'));
        switch ($role) {
            case 'bpw':
                return $this->lookup('tb_provinsi', 'id_provinsi', session()->get('id_provinsi'), 'nama_provinsi') ?: 'BPW';
            case 'bpd':
                return $this->lookup('tb_kota_kabupaten', 'id_kota', session()->get('id_kota'), 'nama_kota') ?: 'BPD';
            case 'bpdes':
                return $this->lookup('tb_desa_kelurahan', 'id_desa', session()->get('id_desa'), 'nama_desa') ?: 'BPDes';
---
SELECT `nama_desa`
FROM `tb_desa_kelurahan`
WHERE `id_desa` = '1010101'