app/Controllers/admin/Bpn.php

    public function indexAcara()
    {
        $acaras = $this->acaraModel
            ->where('created_label', $this->resolvePublisherLabel())
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `tb_acara`
WHERE `created_label` = 'BPN'
ORDER BY `created_at` DESC