app/Controllers/admin/Bpn.php

    public function index()
    {
        $subRole = session()->get('sub_role'); // ambil subrole dari session

        $stats = [];

        // ================== PRESIDEN & SEKJEN BPN ==================
        if ($subRole === 'presiden' || $subRole === 'sekjen') {
            $stats['jumlahMember'] = $this->memberModel
                ->where('status', 'Aktif')
                ->countAllResults();

            $stats['jumlahAdmin'] = $this->bpnModel->countAllResults()
                + $this->bpwModel->countAllResults()
                + $this->bpdModel->countAllResults()
                + $this->bpdesModel->countAllResults();

            $stats['jumlahArtikel'] = $this->artikelModel
                ->where('status', 'approved')
                ->countAllResults();

            $stats['jumlahAcara'] = $this->acaraModel
                ->where('status', 'approved')
                ->countAllResults();

            $stats['jumlahBroadcast'] = $this->emailModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_members`
WHERE `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `tb_bpn`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpw`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpd`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpdes`
SELECT COUNT(*) AS `numrows`
FROM `tb_artikel`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `tb_acara`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `tb_email`


        // ================== OKK BPN ==================
        elseif ($subRole === 'okk') {
            $stats['jumlahMember'] = $this->memberModel
                ->where('status', 'Aktif')
                ->countAllResults();

            $stats['jumlahAdmin'] = $this->bpnModel->countAllResults()
                + $this->bpwModel->countAllResults()
                + $this->bpdModel->countAllResults()
                + $this->bpdesModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_members`
WHERE `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `tb_bpn`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpw`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpd`
SELECT COUNT(*) AS `numrows`
FROM `tb_bpdes`

    public function verifikasiMember()
    {
        $search = $this->request->getGet('q'); // ambil input search

        $builder = $this->memberModel
            ->select('tb_members.*, prov.nama_provinsi, kota.nama_kota, kec.nama_kecamatan, desa.nama_desa')
            ->join('tb_provinsi prov', 'prov.id_provinsi = tb_members.id_provinsi', 'left')
            ->join('tb_kota_kabupaten kota', 'kota.id_kota = tb_members.id_kota', 'left')
            ->join('tb_kecamatan kec', 'kec.id_kecamatan = tb_members.id_kecamatan', 'left')
            ->join('tb_desa_kelurahan desa', 'desa.id_desa = tb_members.id_desa', 'left')
            ->orderBy('tb_members.id', 'DESC'); // urutkan terbaru dulu

        // kalau ada pencarian
        if (!empty($search)) {
            $builder->groupStart()
                ->like('tb_members.nama', $search)
                ->orLike('tb_members.alamat', $search)
                ->orLike('tb_members.email', $search)
                ->orLike('tb_members.telepon', $search)
                ->groupEnd();
        }

        $members = $builder->findAll();
---
SELECT `tb_members`.*, `prov`.`nama_provinsi`, `kota`.`nama_kota`, `kec`.`nama_kecamatan`, `desa`.`nama_desa`
FROM `tb_members`
LEFT JOIN `tb_provinsi` `prov` ON `prov`.`id_provinsi` = `tb_members`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` `kota` ON `kota`.`id_kota` = `tb_members`.`id_kota`
LEFT JOIN `tb_kecamatan` `kec` ON `kec`.`id_kecamatan` = `tb_members`.`id_kecamatan`
LEFT JOIN `tb_desa_kelurahan` `desa` ON `desa`.`id_desa` = `tb_members`.`id_desa`
ORDER BY `tb_members`.`id` DESC