app/Controllers/admin/Bpn.php

SELECT `tb_members`.*, `prov`.`nama_provinsi`, `kota`.`nama_kota`, `kec`.`nama_kecamatan`, `desa`.`nama_desa`
FROM `tb_members`
LEFT JOIN `tb_provinsi` `prov` ON `prov`.`id_provinsi` = `tb_members`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` `kota` ON `kota`.`id_kota` = `tb_members`.`id_kota`
LEFT JOIN `tb_kecamatan` `kec` ON `kec`.`id_kecamatan` = `tb_members`.`id_kecamatan`
LEFT JOIN `tb_desa_kelurahan` `desa` ON `desa`.`id_desa` = `tb_members`.`id_desa`
---
    public function dataMember()
    {
        $members = $this->memberModel
            ->select('tb_members.*, prov.nama_provinsi, kota.nama_kota, kec.nama_kecamatan, desa.nama_desa')
            ->join('tb_provinsi prov', 'prov.id_provinsi = tb_members.id_provinsi', 'left')
            ->join('tb_kota_kabupaten kota', 'kota.id_kota = tb_members.id_kota', 'left')
            ->join('tb_kecamatan kec', 'kec.id_kecamatan = tb_members.id_kecamatan', 'left')
            ->join('tb_desa_kelurahan desa', 'desa.id_desa = tb_members.id_desa', 'left')
            ->findAll();

SELECT `tb_members`.*, `prov`.`nama_provinsi`, `kota`.`nama_kota`, `kec`.`nama_kecamatan`, `desa`.`nama_desa`
FROM `tb_members`
LEFT JOIN `tb_provinsi` `prov` ON `prov`.`id_provinsi` = `tb_members`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` `kota` ON `kota`.`id_kota` = `tb_members`.`id_kota`
LEFT JOIN `tb_kecamatan` `kec` ON `kec`.`id_kecamatan` = `tb_members`.`id_kecamatan`
LEFT JOIN `tb_desa_kelurahan` `desa` ON `desa`.`id_desa` = `tb_members`.`id_desa`
ORDER BY `tb_members`.`id` DESC
---
    public function verifikasiMember()
    {
        $search = $this->request->getGet('q'); // ambil input search

        $builder = $this->memberModel
            ->select('tb_members.*, prov.nama_provinsi, kota.nama_kota, kec.nama_kecamatan, desa.nama_desa')
            ->join('tb_provinsi prov', 'prov.id_provinsi = tb_members.id_provinsi', 'left')
            ->join('tb_kota_kabupaten kota', 'kota.id_kota = tb_members.id_kota', 'left')
            ->join('tb_kecamatan kec', 'kec.id_kecamatan = tb_members.id_kecamatan', 'left')
            ->join('tb_desa_kelurahan desa', 'desa.id_desa = tb_members.id_desa', 'left')
            ->orderBy('tb_members.id', 'DESC'); // urutkan terbaru dulu

        // kalau ada pencarian
        if (!empty($search)) {
            $builder->groupStart()
                ->like('tb_members.nama', $search)
                ->orLike('tb_members.alamat', $search)
                ->orLike('tb_members.email', $search)
                ->orLike('tb_members.telepon', $search)
                ->groupEnd();
        }

        $members = $builder->findAll();