app/Controllers/admin/Bpw.php

    public function dataMember()
{
    $idProvinsi = session()->get('id_provinsi');

    if (!$idProvinsi) {
        return redirect()->to('/login')->with('error', 'Provinsi tidak ditemukan di session');
    }

    $provinsi = $this->provinsiModel->find($idProvinsi);

    $members = $this->memberModel
        ->select('
            tb_members.*,
            tb_provinsi.nama_provinsi,
            tb_kota_kabupaten.nama_kota,
            tb_kecamatan.nama_kecamatan,
            tb_desa_kelurahan.nama_desa
        ')
        ->join('tb_provinsi', 'tb_provinsi.id_provinsi = tb_members.id_provinsi', 'left')
        ->join('tb_kota_kabupaten', 'tb_kota_kabupaten.id_kota = tb_members.id_kota', 'left')
        ->join('tb_kecamatan', 'tb_kecamatan.id_kecamatan = tb_members.id_kecamatan', 'left')
        ->join('tb_desa_kelurahan', 'tb_desa_kelurahan.id_desa = tb_members.id_desa', 'left')
        ->where('tb_members.id_provinsi', $idProvinsi)
        ->findAll();
---
SELECT *
FROM `tb_provinsi`
WHERE `tb_provinsi`.`id_provinsi` = '11'
SELECT `tb_members`.*, `tb_provinsi`.`nama_provinsi`, `tb_kota_kabupaten`.`nama_kota`, `tb_kecamatan`.`nama_kecamatan`, `tb_desa_kelurahan`.`nama_desa`
FROM `tb_members`
LEFT JOIN `tb_provinsi` ON `tb_provinsi`.`id_provinsi` = `tb_members`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` ON `tb_kota_kabupaten`.`id_kota` = `tb_members`.`id_kota`
LEFT JOIN `tb_kecamatan` ON `tb_kecamatan`.`id_kecamatan` = `tb_members`.`id_kecamatan`
LEFT JOIN `tb_desa_kelurahan` ON `tb_desa_kelurahan`.`id_desa` = `tb_members`.`id_desa`
WHERE `tb_members`.`id_provinsi` = '11'