app/Controllers/admin/TambahAdmin/BpdController.php

    public function index()
    {
        // Join tb_bpd with tb_kota_kabupaten to get kota name
        $data['bpd_admins'] = $this->bpdModel
            ->select('tb_bpd.*, tb_kota_kabupaten.nama_kota')
            ->join('tb_kota_kabupaten', 'tb_kota_kabupaten.id_kota = tb_bpd.id_kota', 'left')
            ->findAll();
---
SELECT `tb_bpd`.*, `tb_kota_kabupaten`.`nama_kota`
FROM `tb_bpd`
LEFT JOIN `tb_kota_kabupaten` ON `tb_kota_kabupaten`.`id_kota` = `tb_bpd`.`id_kota`