app/Controllers/admin/TambahAdmin/BpwController.php

    public function index()
    {
        // Join tb_bpw with tb_provinsi to get provinsi name
        $data['bpw_admins'] = $this->bpwModel
            ->select('tb_bpw.*, tb_provinsi.nama_provinsi')
            ->join('tb_provinsi', 'tb_provinsi.id_provinsi = tb_bpw.id_provinsi', 'left')
            ->findAll();
---
SELECT `tb_bpw`.*, `tb_provinsi`.`nama_provinsi`
FROM `tb_bpw`
LEFT JOIN `tb_provinsi` ON `tb_provinsi`.`id_provinsi` = `tb_bpw`.`id_provinsi`