app/Controllers/Auth.php

SELECT *
FROM `tb_superadmin`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
SELECT *
FROM `tb_bpn`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
SELECT *
FROM `tb_bpw`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
---
    public function loginPost()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $account = null;
        $role = null;

        // 1️⃣ Check Superadmin
        $model = new SuperadminModel();
        $account = $model->where('username', $username)->first();
        if ($account) {
            $role = 'superadmin';
        }

        // 2️⃣ Check BPN
        if (!$account) {
            $model = new BpnModel();
            $account = $model->where('username', $username)->first();
            if ($account) {
                $role = 'bpn';
            }
        }

        // 3️⃣ Check BPW
        if (!$account) {
            $model = new BpwModel();
            $account = $model->where('username', $username)->first();

SELECT *
FROM `tb_bpd`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
---
        // 4️⃣ Check BPD (Kota/Kabupaten)
        if (!$account) {
            $model = new BpdModel();
            $account = $model->where('username', $username)->first();

SELECT *
FROM `tb_bpdes`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
---
        // 5️⃣ Check BPDes
        if (!$account) {
            $model = new BpdesModel();
            $account = $model->where('username', $username)->first();

SELECT *
FROM `tb_users`
WHERE `username` = 'sugengcahyono'
 LIMIT 1
---
        // 6️⃣ Check Member (tb_users)
        if (!$account) {
            $model = new UserModel();
            $account = $model->where('username', $username)->first();

SELECT *
FROM `tb_members`
WHERE `user_id` = '24'
 LIMIT 1
---

        // 8️⃣ Extra check for member status
        if ($role === 'member') {
            $member = (new MemberModel())->where('user_id', $account['id'])->first();