app/Controllers/Home.php

SELECT *
FROM `tb_artikel`
ORDER BY `tanggal_publikasi` DESC
 LIMIT 4
SELECT *
FROM `tb_acara`
WHERE `status` = 'approved'
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function index()
    {
        // Ambil 4 artikel terbaru
        $latestArticles = $this->artikelModel
            ->orderBy('tanggal_publikasi', 'DESC')
            ->limit(4)
            ->findAll();

        // Ambil 3 acara terbaru (untuk homepage)
        $latestAcara = $this->acaraModel
            ->where('status', 'approved') // optional, if you track approval
            ->orderBy('created_at', 'DESC')
            ->limit(3)
            ->findAll();