app/Controllers/MemberController.php

    public function dashboard()
{
    $session = session();
    $userId = $session->get('user_id');
    $role = $session->get('role'); // pastikan saat login role ini diset

    // 🧩 Cek login
    if (!$userId) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // 🧩 Cegah akses oleh selain member
    if ($role !== 'member') {
        return redirect()->to('/unauthorized')->with('error', 'Anda tidak memiliki akses ke halaman ini.');
    }

    // 🔍 Ambil data member
    $db = \Config\Database::connect();
    $builder = $db->table('tb_members m');
    $builder->select('m.*,
        prov.nama_provinsi AS nama_provinsi,
        kota.nama_kota AS nama_kota,
        desa.nama_desa AS nama_desa');
    $builder->join('tb_provinsi prov', 'prov.id_provinsi = m.id_provinsi', 'left');
    $builder->join('tb_kota_kabupaten kota', 'kota.id_kota = m.id_kota', 'left');
    $builder->join('tb_desa_kelurahan desa', 'desa.id_desa = m.id_desa', 'left');
    $builder->where('m.user_id', $userId);

    $query = $builder->get();
---
SELECT `m`.*, `prov`.`nama_provinsi` AS `nama_provinsi`, `kota`.`nama_kota` AS `nama_kota`, `desa`.`nama_desa` AS `nama_desa`
FROM `tb_members` `m`
LEFT JOIN `tb_provinsi` `prov` ON `prov`.`id_provinsi` = `m`.`id_provinsi`
LEFT JOIN `tb_kota_kabupaten` `kota` ON `kota`.`id_kota` = `m`.`id_kota`
LEFT JOIN `tb_desa_kelurahan` `desa` ON `desa`.`id_desa` = `m`.`id_desa`
WHERE `m`.`user_id` = '18'