app/Controllers/VerifikasiArtikel.php

    public function index()
    {
        $data['artikel'] = $this->artikelModel->findAll(); // show all articles
---
SELECT *
FROM `tb_artikel`