app/Models/ArtikelModel.php

    public function getBySlug(string $slug)
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `tb_artikel`
WHERE `slug` = 'cek-judul-baru'
 LIMIT 1